package hillel.plyska.lesson3;

public class Task1 {
 /*   1. Написать метод считающий сколько в строке встречается определенный символ.
    Посчитать в ваших инициалах из первой задачи сколько пробелов и звездочек.
*/

    public static void main(String[] args) {
        String cd = "a";
        String  row  = "Thas has done ba";
        int sum = 0;
        System.out.println(row.length());
        char [] stringToChar =  row.toCharArray();
        for (int a=0; a <stringToChar.length; a ++){
            if (stringToChar[a]== cd.toChar){

            }
        }
    }
}
